gcl8a/SparkFun_ESP8266_AT_Arduino_Library/src/SparkFunESP8266WiFi.cpp
    int16_t rsp = readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT);
    //if (rsp > 0)
    if (rsp != ESP8266_RSP_FAIL)
    {
        print((const char *)buf);
        
        rsp = readForResponse("SEND OK", COMMAND_RESPONSE_TIMEOUT);
        
        if (rsp > 0)
            return size;
    }
    
    return rsp;
}

/*
 * tcpReceive captures input line-by-line (almost -- it deals with +IPD commands separately)
 */

int16_t ESP8266Class::tcpReceive(uint8_t linkID, char* buffer, uint16_t buffer_len, uint32_t timeout)
{
    clearBuffer();
    uint32_t lastRead = millis();
    
    while(millis() - lastRead < timeout)
    {
        if(_serial->available())
        {
            //read byte and check for overflow
            int8_t errorCode = 0;
            char c = readByteToBuffer(errorCode);
            if(errorCode == ESP8266_BUF_OVF)
            {
                return ESP8266_BUF_OVF;
            }

            lastRead = millis();

            char* ipd = NULL;
            
            switch(recState)
            {
                case ESP8266_REC_WAITING: //waiting for either an IPD signal or CLOSED (anything else???)
                    //search for IPD
                    ipd = strstr(esp8266RxBuffer, "+IPD");
                    if(ipd)
                    {
                        //we have an IPD signal, so clear the buffer and prepare to get the byte count
                        clearBuffer();
                        recState = ESP8266_REC_IPD;
                    }
                    
                    else if(c == '\n') //we've gotten a complete line with no IPD => done
                    {
                        //see if we got a CLOSED signal
                        if(strstr(esp8266RxBuffer, "CLOSED"))
                        {
                            //socket is closed for us
                            recState = ESP8266_REC_CLOSED;
                            //TODO: should also clear the socket
                            return 0; ///////????
                        }
                        
                        //otherwise, just return whatever we have, which could be as little as \r\n
                        //if there is nothing else, it'll timeout next time through
                        else
                        {
                            memset(buffer, '\0', buffer_len);
                            memcpy(buffer, esp8266RxBuffer, strlen(esp8266RxBuffer)); //CAREFUL on length!!!
                            
                            return strlen(esp8266RxBuffer);
                        }
                    }
                    break;
                    
                case ESP8266_REC_IPD: //need to get the character count
                    // for the moment, assume string has the form: +IPD,0,###:
                    // where number of # digits is unknown
                    if(strstr(esp8266RxBuffer, ":")) //a bit ugly, but should work to get up to the colon
                    {
                        tcpRecvCount = atoi(&esp8266RxBuffer[3]); //atoi automatically breaks out at ':'
                        clearBuffer();
                        recState = ESP8266_REC_RECEIVING; //switch to receiving data
                    }
                    break;
                    
                case ESP8266_REC_RECEIVING:
                    tcpRecvCount--;
                    if(!tcpRecvCount) //finished this block; need to check for another IPD
                    {
                        recState = ESP8266_REC_WAITING;
                    }
                    
                    if(c == '\n' || !tcpRecvCount) //we've gotten a complete line, or we're done, so return buffer
                    {
                        memset(buffer, '\0', buffer_len);
                        memcpy(buffer, esp8266RxBuffer, strlen(esp8266RxBuffer)); //CAREFUL on length!!!
                        
                        return strlen(esp8266RxBuffer);
                    }
                    break;
                    
                case ESP8266_REC_CLOSED: //anything special here?
                default:
                    return ESP8266_RSP_FAIL; //something is seriously wrong if we get here...
            }
        }
    }
    
    return ESP8266_RSP_TIMEOUT;
}

int16_t ESP8266Class::close(uint8_t linkID)
{
	char params[2];
	sprintf(params, "%d", linkID);
	sendCommand(ESP8266_TCP_CLOSE, ESP8266_CMD_SETUP, params);
	
	// Eh, client virtual function doesn't have a return value.
	// We'll wait for the OK or timeout anyway.
	return readForResponse(RESPONSE_OK, COMMAND_RESPONSE_TIMEOUT);
}

int16_t ESP8266Class::setTransferMode(uint8_t mode)
{
	char params[2] = {0, 0};
	params[0] = (mode > 0) ? '1' : '0';
	sendCommand(ESP8266_TRANSMISSION_MODE, ESP8266_CMD_SETUP, params);
	
	return readForResponse(RESPONSE_OK, COMMAND_RESPONSE_TIMEOUT);
}

int16_t ESP8266Class::setMux(uint8_t mux)
{
	char params[2] = {0, 0};
	params[0] = (mux > 0) ? '1' : '0';
	sendCommand(ESP8266_TCP_MULTIPLE, ESP8266_CMD_SETUP, params);
	
	return readForResponse(RESPONSE_OK, COMMAND_RESPONSE_TIMEOUT);
}

int16_t ESP8266Class::configureTCPServer(uint16_t port, uint8_t create)
{
	char params[10];
	if (create > 1) create = 1;
	sprintf(params, "%d,%d", create, port);
	sendCommand(ESP8266_SERVER_CONFIG, ESP8266_CMD_SETUP, params);
	
	return readForResponse(RESPONSE_OK, COMMAND_RESPONSE_TIMEOUT);	
}

int16_t ESP8266Class::ping(IPAddress ip)
{
	char ipStr[17];
	sprintf(ipStr, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
	return ping(ipStr);
}

int16_t ESP8266Class::ping(char * server)
{
	char params[strlen(server) + 3];
	sprintf(params, "\"%s\"", server);
	// Send AT+Ping=<server>
	sendCommand(ESP8266_PING, ESP8266_CMD_SETUP, params); 
	// Example responses:
	//  * Good response: +12\r\n\r\nOK\r\n
	//  * Timeout response: +timeout\r\n\r\nERROR\r\n
	//  * Error response (unreachable): ERROR\r\n\r\n
	int16_t rsp = readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_PING_TIMEOUT);
	if (rsp > 0)
	{
		char * p = searchBuffer("+");
		p += 1; // Move p forward 1 space
		char * q = strchr(p, '\r'); // Find the first \r
		if (q == NULL)
			return ESP8266_RSP_UNKNOWN;
		char tempRsp[10];
		strncpy(tempRsp, p, q - p);
		return atoi(tempRsp);
	}
	else
	{
		if (searchBuffer("timeout") != NULL)
			return 0;
	}
	
	return rsp;
}

//////////////////////////
// Custom GPIO Commands //
//////////////////////////
int16_t ESP8266Class::pinMode(uint8_t pin, uint8_t mode)
{
	char params[5];
	
	char modeC = 'i'; // Default mode to input
	if (mode == OUTPUT) 
		modeC = 'o'; // o = OUTPUT
	else if (mode == INPUT_PULLUP) 
		modeC = 'p'; // p = INPUT_PULLUP
	
