gcl8a/SparkFun_ESP8266_AT_Arduino_Library/src/SparkFunESP8266WiFi.cpp
	sprintf(params, "%d,%c", pin, modeC);
	sendCommand(ESP8266_PINMODE, ESP8266_CMD_SETUP, params);
	
	return readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT);
}

int16_t ESP8266Class::digitalWrite(uint8_t pin, uint8_t state)
{
	char params[5];
	
	char stateC = 'l'; // Default state to LOW
	if (state == HIGH) 
		stateC = 'h'; // h = HIGH
	
	sprintf(params, "%d,%c", pin, stateC);
	sendCommand(ESP8266_PINWRITE, ESP8266_CMD_SETUP, params);
	
	return readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT);
}

int8_t ESP8266Class::digitalRead(uint8_t pin)
{
	char params[3];
	
	sprintf(params, "%d", pin);
	sendCommand(ESP8266_PINREAD, ESP8266_CMD_SETUP, params); // Send AT+PINREAD=n\r\n
	// Example response: 1\r\n\r\nOK\r\n
	if (readForResponses(RESPONSE_OK, RESPONSE_ERROR, COMMAND_RESPONSE_TIMEOUT) > 0)
	{
		if (strchr(esp8266RxBuffer, '0') != NULL)
			return LOW;
		else if (strchr(esp8266RxBuffer, '1') != NULL)
			return HIGH;
	}
	
	return -1;
}

//////////////////////////////
// Stream Virtual Functions //
//////////////////////////////

size_t ESP8266Class::write(uint8_t c)
{
    //SerialUSB.print((char)c);
	return _serial->write(c);
}

int ESP8266Class::available()
{
	return _serial->available();
}

int ESP8266Class::read()
{
    int ch = _serial->read();
    //SerialUSB.print((char)ch);
    return ch;
}

int ESP8266Class::peek()
{
	return _serial->peek();
}

void ESP8266Class::flush()
{
	_serial->flush();
}

//////////////////////////////////////////////////
// Private, Low-Level, Ugly, Hardware Functions //
//////////////////////////////////////////////////

void ESP8266Class::sendCommand(const char * cmd, enum esp8266_command_type type, const char * params)
{
	/*_serial->*/print("AT");
	/*_serial->*/print(cmd);
	if (type == ESP8266_CMD_QUERY)
		/*_serial->*/print('?');
	else if (type == ESP8266_CMD_SETUP)
	{
		/*_serial->*/print("=");
		/*_serial->*/print(params);
	}
	/*_serial->*/print("\r\n");
}

int16_t ESP8266Class::readForResponse(const char * rsp, unsigned int timeout)
{
	unsigned long lastRead = millis();	// Timestamp coming into function
	unsigned int received = 0; // received keeps track of number of chars read
	
	clearBuffer();	// Clear the class receive buffer (esp8266RxBuffer)
	while (millis() - lastRead < timeout) // While we haven't timed out
	{
		if (_serial->available()) // If data is available on UART RX
		{
            lastRead = millis();
			received += readByteToBuffer();
			if (searchBuffer(rsp))	// Search the buffer for goodRsp
				return received;	// Return how number of chars read
		}
	}
	
	if (received > 0) // If we received any characters
    {
//        SerialUSB.print("error: ");
//        SerialUSB.println(esp8266RxBuffer);
		return ESP8266_RSP_UNKNOWN; // Return unkown response error code
    }
	else // If we haven't received any characters
		return ESP8266_RSP_TIMEOUT; // Return the timeout error code
}

int16_t ESP8266Class::readForResponses(const char * pass, const char * fail, unsigned int timeout)
{
	unsigned long timeIn = millis();	// Timestamp coming into function
	unsigned int received = 0; // received keeps track of number of chars read
	
	clearBuffer();	// Clear the class receive buffer (esp8266RxBuffer)
	while (timeIn + timeout > millis()) // While we haven't timed out
	{
		if (_serial->available()) // If data is available on UART RX
		{
			received += readByteToBuffer();
            
            //this is painful: searching the buffer every freakin' character?
			if (searchBuffer(pass))	// Search the buffer for goodRsp
				return received;	// Return how number of chars read
			if (searchBuffer(fail))
				return ESP8266_RSP_FAIL;
		}
	}
	
	if (received > 0) // If we received any characters
		return ESP8266_RSP_UNKNOWN; // Return unkown response error code
	else // If we haven't received any characters
		return ESP8266_RSP_TIMEOUT; // Return the timeout error code
}

//////////////////
// Buffer Stuff //
//////////////////
void ESP8266Class::clearBuffer()
{
	memset(esp8266RxBuffer, '\0', ESP8266_RX_BUFFER_LEN);
	bufferHead = 0;
}	

//maybe try: char readByte(int8_t& error): return c; set error if needed
//would need to find all calss to readByte, as this breaks some of the calls

char ESP8266Class::readByteToBuffer(int8_t& errorCode) //add char*?
{
    // Read the data in
    char c = /*_serial->*/read();
    //SerialUSB.print(c);
    
    // Store the data in the buffer
    esp8266RxBuffer[bufferHead++] = c;
    
    if(bufferHead == ESP8266_RX_BUFFER_LEN - 1)
    {
        bufferHead--; //reached overflow; all new data will just overwrites at the end
        errorCode = ESP8266_BUF_OVF; //let the caller know
    }
    errorCode = 0;
    
    return c;
}

uint8_t ESP8266Class::readByteToBuffer() //add char*?
{
    // Read the data in
    char c = /*_serial->*/read();
    
    // Store the data in the buffer
    esp8266RxBuffer[bufferHead++] = c;
    
    if(bufferHead == ESP8266_RX_BUFFER_LEN - 1)
    {
        bufferHead--; //reached overflow; all new data will just overwrites at the end
        return ESP8266_BUF_OVF; //let the caller know
    }
    
    return 1;
}

char * ESP8266Class::searchBuffer(const char * test)
{
//    int bufferLen = strlen((const char *)esp8266RxBuffer);
//    // If our buffer isn't full, just do an strstr
//    if (bufferLen < ESP8266_RX_BUFFER_LEN)
    return strstr(esp8266RxBuffer, test); //gcl: removed (const char*) cast -- not sure why it was needed
//    else
//    {    //! TODO
//        // If the buffer is full, we need to search from the end of the 
//        // buffer back to the beginning.
//        int testLen = strlen(test);
//        for (int i=0; i<ESP8266_RX_BUFFER_LEN; i++)
//        {
//            
//        }
//    }
//    
//    return '\0'; //have to return something!
}

ESP8266Class esp8266;
